# FilteredElementIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredElementIterator Class
Members See Also
---
An iterator to a set of elements filtered by the settings of a FilteredElementCollector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilteredElementIterator : IEnumerator<Element>
```

Visual Basic
---
```text
Public Class FilteredElementIterator _
	Implements IEnumerator(Of Element)
```

Visual C++
---
```text
public ref class FilteredElementIterator : IEnumerator<Element^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilteredElementIterator
# See Also
FilteredElementIterator Members
Autodesk.Revit.DB Namespace